jorgebucaran/fisher
jethrokuan/z
patrickf1/fzf.fish
oh-my-fish/plugin-brew
oh-my-fish/plugin-extract
oh-my-fish/plugin-osx
oh-my-fish/plugin-grc
laughedelic/brew-completions
sadanand-singh/fish-sodope
franciscolourenco/done
jorgebucaran/autopair.fish
patrickf3139/colored-man-pages
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-gi
oh-my-fish/plugin-direnv
edc/bass
nakulj/auto-venv
plttn/fish-eza
reitzig/sdkman-for-fish@v2.1.0
jorgebucaran/replay.fish
budimanjojo/tmux.fish
