jorgebucaran/fisher
patrickf1/fzf.fish
franciscolourenco/done
jorgebucaran/autopair.fish
PatrickF1/colored_man_pages.fish
oh-my-fish/plugin-bang-bang
nakulj/auto-venv
givensuman/fish-eza
reitzig/sdkman-for-fish@v2.1.0
jorgebucaran/replay.fish
budimanjojo/tmux.fish
