tap "cockroachdb/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jbangdev/tap"
tap "k0sproject/tap"
tap "siderolabs/tap"
brew "age"
brew "age-plugin-yubikey"
brew "aspell"
brew "atuin"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bottom"
brew "btop"
brew "sqlite"
brew "python@3.13"
brew "chezmoi"
brew "cilium-cli"
brew "coreutils"
brew "crane"
brew "direnv"
brew "dockutil"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "grc"
brew "helm"
brew "htop"
brew "httpie"
brew "hunspell"
brew "iftop"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubie"
brew "lazygit"
brew "libffi"
brew "libfido2"
brew "libheif"
brew "markdown-oxide"
brew "mas"
brew "minio-mc"
brew "neovim"
brew "node"
brew "nvm"
brew "ollama"
brew "openssh"
brew "pipx"
brew "pre-commit"
brew "pwgen"
brew "pyenv"
brew "restic"
brew "ripgrep"
brew "rustup"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "yq"
brew "zellij"
brew "zip"
brew "zsh"
brew "cockroachdb/tap/cockroach"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "jbangdev/tap/jbang"
brew "k0sproject/tap/k0sctl"
brew "siderolabs/tap/talosctl"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "backblaze"
cask "balenaetcher"
cask "bambu-studio"
cask "bartender"
cask "battle-net"
cask "betterdisplay"
cask "brave-browser"
cask "cardhop"
cask "chatgpt"
cask "chronosync"
cask "claude"
cask "cleanmymac"
cask "curseforge"
cask "discord"
cask "disk-drill"
cask "drivethrurpg"
cask "fantastical"
cask "font-awesome-terminal-fonts"
cask "font-dejavu"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-mono"
cask "font-noto-mono-for-powerline"
cask "font-noto-sans"
cask "font-noto-sans-mono"
cask "ghostty"
cask "github"
cask "google-drive"
cask "hammerspoon"
cask "insomnia"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "keycastr"
cask "miniconda"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "parallels"
cask "pdf-expert"
cask "proton-drive"
cask "proton-mail"
cask "rectangle-pro"
cask "slack"
cask "soundsource"
cask "spotify"
cask "syncthing"
cask "teamviewer"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zoom"
mas "1Blocker", id: 1365531024
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Calca", id: 635758264
mas "Calcbot", id: 931657367
mas "Copilot", id: 1447330651
mas "DaisyDisk", id: 411643860
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Gemini 2", id: 1090488118
mas "Grammarly for Safari", id: 1462114288
mas "Hush", id: 1544743900
mas "Keymapp", id: 6472865291
mas "Mapper", id: 1589391989
mas "Name Mangler", id: 603637384
mas "Notion Web Clipper", id: 1559269364
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PhotoSweeper", id: 463362050
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "reMarkable", id: 1276493162
mas "Save to Matter", id: 1548677272
mas "Save to Reader", id: 1640236961
mas "Shapr3D", id: 1091675654
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "StopTheMadness Pro", id: 6471380298
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
vscode "1password.op-vscode"
vscode "bbenoist.nix"
vscode "bmalehorn.vscode-fish"
vscode "coolbear.systemd-unit-file"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "kdl-org.kdl"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "openai.openai-chatgpt-adhoc"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
