tap "andyyyy64/whichllm", trusted: true
tap "antoniorodr/memo", trusted: true
tap "atomicjar/tap", trusted: true
tap "bats-core/bats-core", trusted: true
tap "buo/cask-upgrade", trusted: true
tap "controlplaneio-fluxcd/tap", trusted: true
tap "dagger/tap", trusted: true
tap "dicklesworthstone/tap", trusted: true
tap "fluxcd/tap", trusted: true
tap "fzymgc-house/tap", trusted: true
tap "gastownhall/beads", "https://github.com/gastownhall/homebrew-beads.git", trusted: true
tap "go-task/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew/core"
tap "int128/kubelogin", trusted: true
tap "jbangdev/tap", trusted: true
tap "manaflow-ai/cmux", trusted: true
tap "morantron/tmux-fingers"
tap "nats-io/nats-tools", trusted: true
tap "openhue/cli", trusted: true
tap "oven-sh/bun", trusted: true
tap "pulumi/tap", trusted: true
tap "schpet/tap", trusted: true
tap "yakitrak/yakitrak", trusted: true
tap "zjrosen/perles", trusted: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Scan directories recursively to ensure source files have license headers
brew "addlicense"
# Simple, modern, secure file encryption
brew "age"
# Plugin for encrypting files with age and PIV tokens such as YubiKeys
brew "age-plugin-yubikey"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Spell checker with better logic than ispell
brew "aspell"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Git for Data
brew "dolt"
# Memory upgrade for your coding agent
brew "beads"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# New way of working with Protocol Buffers
brew "buf"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Portable Foreign Function Interface library
brew "libffi"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Command-line tool to manage cert-manager
brew "cmctl"
# Conventional Commits toolbox
brew "cocogitto"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for interacting with remote images and registries
brew "crane"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for managing dock items
brew "dockutil"
# Command-line tool for DigitalOcean
brew "doctl"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# LSP implementation for the fish shell language
brew "fish-lsp"
# Lock file during command
brew "flock"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Human friendly `go test` runner
brew "gotestsum"
# Ping, but with a graph
brew "gping"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Colorize logfiles and command output
brew "grc"
# Kubernetes package manager
brew "helm"
# CLI email client written in Rust
brew "himalaya"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Spell checker and morphological analyzer
brew "hunspell"
# Display an interface's bandwidth usage
brew "iftop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# CLI client for interacting with Incus
brew "incus"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Jq language server
brew "jq-lsp"
# TUI playground to experiment and play with jq
brew "jqp"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Fast and secure open-source backup
brew "kopia"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# CloudNativePG plugin for kubectl
brew "kubectl-cnpg"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Sophisticated file transfer program
brew "lftp"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Fast, async, resource-friendly link checker
brew "lychee"
# Drop-in replacement for MySQL
brew "mariadb"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Documentation generator plugin for Google Protocol Buffers
brew "protoc-gen-doc"
# Password generator
brew "pwgen"
# Rsync for cloud storage
brew "rclone"
# Fast, efficient and secure backup program
brew "restic"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Markdown Linter and Formatter written in Rust
brew "rumdl"
# Rust toolchain installer
brew "rustup"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Command-line utility to interact with Sentry
brew "sentry-cli"
# Smart session manager for the terminal
brew "sesh"
# Work with remote images registries
brew "skopeo"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Soak up standard input and write to a file
brew "sponge"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Language Server Protocol for Terraform
brew "terraform-lsp"
# Linter for Terraform files
brew "tflint"
# Update version constraints in your Terraform configurations
brew "tfupdate"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Your CLI home video recorder
brew "vhs"
# Web Assembly Binary Toolkit
brew "wabt"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# Common assertions for Bats
brew "bats-core/bats-core/bats-assert"
# Supporting library for Bats test helpers
brew "bats-core/bats-core/bats-support"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Unleash the power of Java
brew "jbangdev/tap/jbang"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers", trusted: true
# A tool for creating NATS account and user access configurations
brew "nats-io/nats-tools/nsc"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# CLI for tracking coding agent changes with jujutsu
brew "schpet/tap/jjagent"
brew "yakitrak/yakitrak/obsidian-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Note editor and whiteboard
cask "affine"
# Application launcher and productivity software
cask "alfred"
# Records audio from any application
cask "audio-hijack"
# Data backup and storage service
cask "backblaze"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Menu bar icon organiser
cask "bartender"
# Online gaming platform
cask "battle-net"
# Display management tool
cask "betterdisplay"
# Contacts manager
cask "cardhop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# AI code review CLI
cask "coderabbit"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Containerized environments for coding agents
cask "dagger/tap/container-use"
# OpenJDK distribution from Amazon
cask "corretto@21"
# OpenJDK distribution from Amazon
cask "corretto@25"
# Download and manage your addons and mods
cask "curseforge"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Sync DriveThruRPG libraries to compatible devices
cask "drivethrurpg"
# Calendar software
cask "fantastical"
# Email client
cask "fastmail"
cask "font-awesome-terminal-fonts"
cask "font-dejavu"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-mono-for-powerline"
cask "font-noto-sans"
cask "font-noto-sans-mono"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Desktop automation application
cask "hammerspoon"
# iPhone management application
cask "imazing"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Official Kotlin Language Server
cask "kotlin-lsp"
# Host-based application firewall
cask "little-snitch"
# Cable-free audio router
cask "loopback"
# Minimal installer for conda
cask "miniconda"
# Free and open-source RSS reader
cask "netnewswire@beta"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop virtualization software
cask "parallels"
# PDF reader, editor and annotator
cask "pdf-expert"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# CLI for managing DNS host entries via gRPC over mTLS
cask "fzymgc-house/tap/router-hosts"
# Open source virtual/remote desktop application
cask "rustdesk"
# 3D CAD software
cask "shapr3d"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Tescontainers desktop application for local testing and development
cask "atomicjar/tap/testcontainers-desktop"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "1password.op-vscode"
vscode "anthropic.claude-code"
vscode "bazelbuild.vscode-bazel"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "chrislajoie.vscode-modelines"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.grafana-alloy"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "natizyskunk.sftp"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
