tap "buo/cask-upgrade"
tap "cockroachdb/tap"
tap "controlplaneio-fluxcd/tap"
tap "dagger/tap"
tap "fluxcd/tap"
tap "fzymgc-house/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "jbangdev/tap"
tap "oven-sh/bun"
tap "pulumi/tap"
brew "age"
brew "age-plugin-yubikey"
brew "aspell"
brew "ast-grep"
brew "atuin"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bottom"
brew "btop"
brew "buf"
brew "caddy"
brew "chezmoi"
brew "cilium-cli"
brew "cloudflared"
brew "cmctl"
brew "coreutils"
brew "crane"
brew "sqlite"
brew "node"
brew "devcontainer"
brew "direnv"
brew "dockutil"
brew "dua-cli"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "libusb"
brew "gnupg"
brew "go"
brew "gping"
brew "python@3.13"
brew "grc"
brew "helm"
brew "htop"
brew "httpie"
brew "hunspell"
brew "iftop"
brew "incus"
brew "jq"
brew "jqp"
brew "k3sup"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectl-cnpg"
brew "kubectx"
brew "kubie"
brew "lazygit"
brew "lftp"
brew "libffi"
brew "libfido2"
brew "libheif"
brew "markdown-oxide"
brew "mas"
brew "minio-mc"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openssh"
brew "pipx"
brew "pkgconf"
brew "plantuml"
brew "postgresql@17"
brew "pre-commit"
brew "procs"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "restic"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "s3cmd"
brew "shellcheck"
brew "socat"
brew "sops"
brew "speedtest-cli"
brew "sponge"
brew "starship"
brew "step"
brew "stern"
brew "tcptraceroute"
brew "tflint"
brew "tfupdate"
brew "tree"
brew "unzip"
brew "uv"
brew "velero"
brew "wget"
brew "yq"
brew "zellij"
brew "zip"
brew "zsh"
brew "controlplaneio-fluxcd/tap/flux-operator-mcp"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "jbangdev/tap/jbang"
brew "oven-sh/bun/bun"
brew "pulumi/tap/pulumi"
cask "1password"
cask "1password-cli"
cask "affine"
cask "alfred"
cask "backblaze"
cask "balenaetcher"
cask "bambu-studio"
cask "bartender"
cask "battle-net"
cask "betterdisplay"
cask "cardhop"
cask "chatgpt"
cask "claude"
cask "cleanmymac"
cask "container-use"
cask "corretto@21"
cask "curseforge"
cask "cursor"
cask "discord"
cask "disk-drill"
cask "docker-desktop"
cask "drivethrurpg"
cask "fantastical"
cask "font-awesome-terminal-fonts"
cask "font-dejavu"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-mono"
cask "font-noto-mono-for-powerline"
cask "font-noto-sans"
cask "font-noto-sans-mono"
cask "ghostty"
cask "github"
cask "google-drive"
cask "hammerspoon"
cask "imazing"
cask "insomnia"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keycastr"
cask "miniconda"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "parallels"
cask "pdf-expert"
cask "raycast"
cask "rectangle-pro"
cask "rustdesk"
cask "slack"
cask "soundsource"
cask "spotify"
cask "syncthing-app"
cask "teamviewer"
cask "telegram"
cask "visual-studio-code"
cask "vivaldi"
cask "warp"
cask "zed"
cask "zoom"
vscode "1password.op-vscode"
vscode "anthropic.claude-code"
vscode "bazelbuild.vscode-bazel"
vscode "bmalehorn.vscode-fish"
vscode "charliermarsh.ruff"
vscode "chrislajoie.vscode-modelines"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "natizyskunk.sftp"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
