tap "cockroachdb/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jbangdev/tap"
tap "siderolabs/tap"
brew "age"
brew "aspell"
brew "atuin"
brew "bat"
brew "bottom"
brew "btop"
brew "entr"
brew "chezmoi"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "grc"
brew "helm"
brew "htop"
brew "httpie"
brew "hunspell"
brew "iftop"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubie"
brew "lazygit"
brew "minio-mc"
brew "neovim"
brew "node"
brew "nvm"
brew "pre-commit"
brew "pwgen"
brew "pyenv"
brew "restic"
brew "ripgrep"
brew "rustup"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "yq"
brew "zellij"
brew "zip"
brew "zsh"
brew "cockroachdb/tap/cockroach"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "jbangdev/tap/jbang"
brew "siderolabs/tap/talosctl"
