ilancosman/tide@v5
jethrokuan/z
patrickf1/fzf.fish
andreiborisov/sponge
jorgebucaran/autopair.fish
nickeb96/puffer-fish
gazorby/fish-abbreviation-tips
decors/fish-colored-man
gazorby/fish-exa
oh-my-fish/plugin-brew
oh-my-fish/plugin-gi
oh-my-fish/plugin-foreign-env
oh-my-fish/plugin-sudope
