jorgebucaran/fisher
oh-my-fish/plugin-brew
oh-my-fish/plugin-gi
oh-my-fish/plugin-foreign-env
gazorby/fish-abbreviation-tips
decors/fish-colored-man
ilancosman/tide@v5.5.1
patrickf1/fzf.fish
andreiborisov/sponge
jorgebucaran/autopair.fish
oh-my-fish/plugin-direnv
kidonng/vscode.fish
nickeb96/puffer-fish
jorgebucaran/autopair.fish
ilancosman/tide@v5.5.1
seanb4t/fish-exa
